inaciose/ackerbot_esp32/src/main.cpp
#ifdef ENABLE_GPS
  // gps publisher

  gps_common::GPSStatus gps_status_msg;
  gps_common::GPSFix gps_msg;
  ros::Publisher gpsPublisher("gps", &gps_msg);

  //std_msgs::Int16MultiArray gps_data;
  std_msgs::Float32MultiArray gps_data;
  ros::Publisher gpsPublisherRaw("gps_raw", &gps_data);
  #define GPS_PUB_TIMER 100

  void gpsPub() {
    static long unsigned int gpsPubTimer = 0;
    if(millis() >= gpsPubTimer) {
      gpsPubTimer = millis() + GPS_PUB_TIMER;

      float values[3] = {(float)gps_lat, (float)gps_lng, 0};
      gps_data.data = (std_msgs::Float32MultiArray::_data_type *)values;
      //gps_data.layout.dim_length = 1;
      gps_data.data_length = 3;

      //gpsPublisher.publish( &gps_data );

      gps_status_msg.header.stamp = nh.now();
      gps_status_msg.satellites_used = gps_satellites;
      if(gps_status != 2) {
        gps_status_msg.status = -1;
      } else {
        gps_status_msg.status = 0;
      }

      gps_msg.header.stamp = nh.now();
      gps_msg.latitude = gps_lat;
      gps_msg.longitude = gps_lng;
      gps_msg.altitude = gps_altitude;
      gps_msg.track = gps_course;
      gps_msg.speed = gps_speed;
      gps_msg.time = gps_time;
      gps_msg.hdop = gps_hdop;

      gps_msg.status = gps_status_msg;

      gpsPublisher.publish( &gps_msg);
    }
  }
#endif


float steering_angle = 0;
float velocity_target = 0;

float twist_angular = 0;
float twist_linear = 0;

long unsigned int secondTimer = 0;
long unsigned int loopInfoTimer = 0;

void setPidTarget() {
  int encoderPulsesTarget = 0;

  leftSpeedPidSetPointTmp = -leftSpeedPidSetPointTmp;

	// pid
	// set left motors direction and speed
	if(leftSpeedPidSetPointTmp > 0) {
		leftSpeedPidSetPointDirection = 1;
		leftSpeedPidSetPoint = round(leftSpeedPidSetPointTmp);
	} else if(leftSpeedPidSetPointTmp < 0) {
		leftSpeedPidSetPointDirection = -1;
		leftSpeedPidSetPoint = round(abs(leftSpeedPidSetPointTmp));
	} else {
		leftSpeedPidSetPointDirection = 0;
		leftSpeedPidSetPoint = round(leftSpeedPidSetPointTmp);
	}

	leftSpeedPid.SetMode(AUTOMATIC);

	// set the target for encoders if any
	if(encoderPulsesTarget) {
		// set left encoder target
		if(leftSpeedPidSetPointDirection >= 0) {
			//encoderLeftPulsesTarget = encoderLeftPulses + (float)(abs(encoderLeftPulsesTarget) / 1000.0 * pulses_per_m);
			encoderLeftPulsesTarget = encoderLeftPulses + abs(encoderPulsesTarget);    
		} else {
			//encoderLeftPulsesTarget = encoderLeftPulses - (float)(abs(encoderLeftPulsesTarget) / 1000.0 * pulses_per_m);
			encoderLeftPulsesTarget = encoderLeftPulses - abs(encoderPulsesTarget);
		}

		encoderLeftPulsesOnTarget = false;
		encoderPulsesTargetEnabled = true;
		// debug only
		encoderLeftPulsesTargetStart = encoderLeftPulses;
	} else {
		encoderLeftPulsesTarget = 0;
		encoderLeftPulsesOnTarget = false;
		encoderPulsesTargetEnabled = false;
		// debug only
		encoderLeftPulsesTargetStart = 0;
	}
}

void twistMsgCb(const geometry_msgs::Twist& msg) {

  // working in dirvel mode
  if(!twist_mode) return;
	
	velocity_target = msg.linear.x;
	twist_linear = msg.linear.x;
	twist_angular = msg.angular.z;

	if(velocity_target == 0 || msg.angular.z == 0) {
		steering_angle = 0;
	} else {
		float radius = velocity_target / msg.angular.z;
		steering_angle = atan(wheelbase / radius);
	}

	steering_angle = -steering_angle;

	// dx = (l + r) / 2
	// dr = (r - l) / w
	//float speed_wish_right = (cmd_vel.angle*WHEEL_DIST)/2 + cmd_vel.speed;
	//float speed_wish_left = velocity_target * 2 - speed_wish_right;

	leftSpeedPidSetPointTmp = velocity_target * 2 - ((msg.angular.z * (wheelbase)) / 2 + velocity_target);

	leftSpeedPidSetPointTmp = (leftSpeedPidSetPointTmp * ppm) / SPEED_PID_SAMPLE_FREQ;

	setPidTarget();

}

ros::Subscriber<geometry_msgs::Twist> cmdVelSubscribe("cmd_vel", &twistMsgCb);

void servo_dir( const std_msgs::Int16 & cmd_msg){
  servo1.write(cmd_msg.data); // servo angle, range 0-180
  servo1Angle = cmd_msg.data;  
  twist_mode = 0;
}

ros::Subscriber<std_msgs::Int16> sub_dir("pub_dir", servo_dir);

void motor_vel( const std_msgs::Int16 & cmd_msg){
  velocity_target = cmd_msg.data / 1000.0;	
  leftSpeedPidSetPointTmp = (cmd_msg.data * ppm / 1000.0) / SPEED_PID_SAMPLE_FREQ;
  setPidTarget(); 
}

ros::Subscriber<std_msgs::Int16> sub_vel("pub_vel", motor_vel);
// eof:ROS

#ifdef ENABLE_MPU6050
// mpu6050
// dmp isr
static void IRAM_ATTR dmpDataReady(void * arg) {
    mpuInterrupt = true;
}
#endif

IRAM_ATTR void encoderLeftCounterA() {
  // look for a low-to-high on channel A
  if (digitalRead(ENCODER_LEFT_PINA) == HIGH) {
    // check channel B to see which way encoder is turning
    if (digitalRead(ENCODER_LEFT_PINB) == LOW) {
      encoderLeftPulses = encoderLeftPulses - 1;         // CW
      // pid
      encoderLeftPulsesSpeedPID--;
      encoderLeftPulsesSteeringPID--;
    } else {
      encoderLeftPulses = encoderLeftPulses + 1;         // CCW
      // pid
      encoderLeftPulsesSpeedPID++;
      encoderLeftPulsesSteeringPID++;
    }
  } else {
    // its low-to-high-to-low on channel A
    // check channel B to see which way encoder is turning
    if (digitalRead(ENCODER_LEFT_PINB) == HIGH) {
      encoderLeftPulses = encoderLeftPulses - 1;          // CW
      // pid
      encoderLeftPulsesSpeedPID--;
      encoderLeftPulsesSteeringPID--;
    } else {
      encoderLeftPulses = encoderLeftPulses + 1;          // CCW
      // pid
      encoderLeftPulsesSpeedPID++;
      encoderLeftPulsesSteeringPID++;
    }
  }
}

IRAM_ATTR void encoderLeftCounterB() {
  // look for a low-to-high on channel B
  if (digitalRead(ENCODER_LEFT_PINB) == HIGH) {

    // check channel A to see which way encoder is turning
    if (digitalRead(ENCODER_LEFT_PINA) == HIGH) {
      encoderLeftPulses = encoderLeftPulses - 1;         // CW
      encoderLeftPulsesSpeedPID--;
      encoderLeftPulsesSteeringPID--;
    }
    else {
      encoderLeftPulses = encoderLeftPulses + 1;         // CCW
      encoderLeftPulsesSpeedPID++;
      encoderLeftPulsesSteeringPID++;
    }
  }

