inaciose/ackerbot_esp32/src/main.cpp
  // Look for a high-to-low on channel B
  else {
    // check channel B to see which way encoder is turning
    if (digitalRead(ENCODER_LEFT_PINA) == LOW) {
      encoderLeftPulses = encoderLeftPulses - 1;          // CW
      encoderLeftPulsesSpeedPID--;
      encoderLeftPulsesSteeringPID--;
    }
    else {
      encoderLeftPulses = encoderLeftPulses + 1;          // CCW
      encoderLeftPulsesSpeedPID++;
      encoderLeftPulsesSteeringPID++;
    }
  }
}

void motorGoFront(int speed) {
	if(motorState != 1) {
		digitalWrite(IN1, LOW);
		digitalWrite(IN2, HIGH);
		motorState = 1;
	}
	analogWrite(ENA, speed);
}

void motorGoBack(int speed) {
	if(motorState != -1) {
		digitalWrite(IN1, HIGH);
		digitalWrite(IN2, LOW);
		motorState = -1;
	}
	analogWrite(ENA, speed);
}

void motorStop() {
	if(motorState != 0) {
		analogWrite(ENA, 0);
		digitalWrite(IN1, LOW);
		digitalWrite(IN2, LOW);
		motorState = 0;
	}
}

void bodyMotorsControl() {
  // set motor left direction & speed
  if(leftMotorPwmOut == 0) {
	motorStop();
  } else if(leftMotorPwmOut > 0) {
    motorGoFront(leftMotorPwmOut);
  } else {
    motorGoBack(abs(leftMotorPwmOut));  
  }
}

boolean leftSpeedPidCompute() {
  boolean pidResult;
  leftSpeedPidInput = abs(encoderLeftPulsesSpeedPID);
  pidResult = leftSpeedPid.Compute(); 
  if(pidResult) {
    encoderLeftPulsesSpeedPID = 0;
    leftSpeedPidInputLast = leftSpeedPidInput;
	speed = (encoderLeftPulses - speedLastPulses) * mpp * SPEED_PID_SAMPLE_FREQ;
	speedLastPulses = encoderLeftPulses;
  }
  return pidResult;
}

void update_PID() {
  // calculate speedPid
  leftSpeedPidResult = leftSpeedPidCompute();

  if(leftSpeedPidSetPoint) {
	// show something to debug
	
	/*
	Serial.print(leftSpeedPidSetPoint);
	Serial.print("\t");
	Serial.print(leftSpeedPidInputLast);
	Serial.println("\n");
	*/
/*
	Serial.print(steering_angle);
	Serial.print("\t");
	Serial.print(velocity_target);
	Serial.print("\t");
	Serial.print(speedOs);
	Serial.print("\t");
	Serial.print(speed);
	Serial.print("\t");
	
	Serial.print(leftSpeedPidSetPoint);
	Serial.print("\t");
	Serial.print(leftSpeedPidInputLast);
	Serial.print("\t");
	
	Serial.print(encoderLeftPulses);
	Serial.print("\t");
	Serial.print(leftMotorPwmOut);
	Serial.print("\t");
	Serial.print(motorState);
	Serial.print("\t");
	Serial.println(servo1Angle);
*/	
  }
}

#ifdef ENABLE_MPU6050

  // imu publisher
  sensor_msgs::Imu imu_data;
  ros::Publisher imuPublisher("imu", &imu_data);


  //std_msgs::Float32MultiArray imu_data;
  //ros::Publisher imuPublisher("imu_raw", &imu_data);
  #define IMU_PUB_TIMER 50

  void mpuDMP() {
      static uint32_t timer = millis();

      // if programming failed, don't try to do anything
      if (!dmpReady) return;
      // read a packet from FIFO
      if (mpu.dmpGetCurrentFIFOPacket(fifoBuffer)) { // Get the Latest packet 
          if(millis() > timer) {
              timer = millis() + IMU_PUB_TIMER;
          //#ifdef OUTPUT_READABLE_YAWPITCHROLL
              // display Euler angles in degrees
              mpu.dmpGetQuaternion(&q, fifoBuffer);
              mpu.dmpGetGravity(&gravity, &q);
              mpu.dmpGetYawPitchRoll(ypr, &q, &gravity);
              Serial.print("ypr\t");
              Serial.print(ypr[0] * 180/M_PI);
              Serial.print("\t");
              Serial.print(ypr[1] * 180/M_PI);
              Serial.print("\t");
              Serial.println(ypr[2] * 180/M_PI);

              imu_data.orientation.x = q.x;
              imu_data.orientation.y = q.y;
              imu_data.orientation.z = q.z;
              imu_data.orientation.w = q.w;

              mpu.dmpGetQuaternion(&q, fifoBuffer);
              mpu.dmpGetAccel(&aa, fifoBuffer);
              mpu.dmpGetGravity(&gravity, &q);
              mpu.dmpGetLinearAccel(&aaReal, &aa, &gravity);

              // should be in m/s^2.
              imu_data.linear_acceleration.x = aaReal.x * 1/16384. * 9.80665;
              imu_data.linear_acceleration.y = aaReal.y * 1/16384. * 9.80665;
              imu_data.linear_acceleration.z = aaReal.z * 1/16384. * 9.80665;

              mpu.dmpGetQuaternion(&q, fifoBuffer);
              mpu.dmpGetGravity(&gravity, &q);
              mpu.dmpGetYawPitchRoll(ypr, &q, &gravity);

              // Should be in rad/sec.
              imu_data.angular_velocity.x = ypr[2];
              imu_data.angular_velocity.y = ypr[1];
              imu_data.angular_velocity.z = ypr[0];

              imu_data.header.stamp = nh.now();

              imuPublisher.publish(&imu_data);


          //#endif
          }
      }
  }
#endif

void lcdMessage(int cls, int line, String msg) {
  #ifdef ENABLE_OLED
    if(hasDisplay) {
        if(cls) display.clear();
        //display.drawString(128 / 2, 32 / 2, msg);
        display.drawString(0, line * 16, msg);
        display.display();
    }
  #endif
}

void lcdUpdate() {

	static long unsigned int displayTimer = 0;
  static boolean info_state = 0;
	if(millis() >= displayTimer) {
		displayTimer = millis() + 1000;
    info_state = !info_state;

    lcdMessage(1, 0, ip.toString());
    if(info_state) {
      lcdMessage(0, 1, masterip.toString());
    } else {
      #ifdef ENABLE_GPS
      if(gps_status == 0)
        lcdMessage(0, 1, "gps error");
      if(gps_status == 1)
        lcdMessage(0, 1, "gps wait");
      if(gps_status == 2)
        lcdMessage(0, 1, "gps ok");
      #else
        lcdMessage(0, 1, masterip.toString());
      #endif
    }
    if (ros_connected) {
      lcdMessage(0, 2, "connected");
    } else {
      lcdMessage(0, 2, "not connected");
    }
  }
}

void blinkLedBuiltin() {
	static boolean ledstate = 0;
	static long unsigned int ledTimer = 0;
	if(millis() >= ledTimer) {
		ledTimer = millis() + led_time;
		ledstate = !ledstate;
		digitalWrite(LED_BUILTIN, ledstate);
	}
}

// wifi manager report ap callback
void configModeCallback (WiFiManager *myWiFiManager) {
  IPAddress ip;
  Serial.println("Entered config mode");
  ip = WiFi.softAPIP();
  Serial.println(WiFi.softAPIP());
  Serial.println(myWiFiManager->getConfigPortalSSID());

