inaciose/ackerbot_esp32/src/main.cpp
  leftMotorPwmOut = 0;
  if(leftSpeedPidSetPoint != 0) {
    leftMotorPwmOut = leftSpeedPidOutput * leftSpeedPidSetPointDirection; // - steeringPidOutput;
  }

  update_PID();
  bodyMotorsControl();

	// speed calculation m/s, on second
	if(millis() >= secondTimer) {
		secondTimer = millis() + 1000;
		speedOs = (encoderLeftPulses - speedOsLastPulses) * mpp;
		speedOsLastPulses = encoderLeftPulses;
	}

	if(millis() >= loopInfoTimer) {
		loopInfoTimer = millis() + 100;
		
		Serial.print(twist_angular);
		Serial.print("\t");
		Serial.print(steering_angle);
		Serial.print("\t");
		Serial.print(servo1Angle);
		Serial.print(" | \t");
		Serial.print(twist_linear);
		Serial.print("\t");
		Serial.print(velocity_target);
		Serial.print(" | \t");
		Serial.print(speedOs);
		Serial.print("\t");
		Serial.print(speed);
		Serial.print("\t");
		Serial.print(leftSpeedPidSetPoint, 0);
		Serial.print("\t");
		Serial.print(leftSpeedPidInputLast);
		Serial.print("\t");
		Serial.print(encoderLeftPulses);
		Serial.print("\t");
		Serial.print(leftMotorPwmOut);
		Serial.print("\t");
		Serial.println(motorState);
		
	}

  #ifdef ENABLE_GPS
    while (Serial2.available() > 0)
      if (gps.encode(Serial2.read())) {
        if (gps.location.isValid()) {
          gps_lat = gps.location.lat();         // double > f64
          gps_lng = gps.location.lng();         // double > f64
          gps_time = gps.time.value();          // u32 > f64
          gps_speed = gps.speed.mps();          // double > f64
          gps_altitude = gps.altitude.meters(); // double > f64
          gps_course = gps.course.deg();        // double > f64
          gps_satellites = gps.satellites.value(); // u32 >
          gps_hdop = gps.hdop.value();          // i32 > f64 

          Serial.print(gps_lat, 6);
          Serial.print(F(","));
          Serial.println(gps_lng, 6);

          gps_status = 2;
        } else {
          Serial.println(F("gps invalid, wait for sattelites"));
          gps_status = 1;
        }        
      }

    if (millis() > 5000 && gps.charsProcessed() < 10) {
      gps_status = 0;
      Serial.println(F("No GPS detected: check wiring."));
      //while(true);
    }
  #endif

  #ifdef ENABLE_MPU6050    
    mpuDMP();
  #endif

  if ( digitalRead(BUTTON1_PIN) == HIGH ) { 
    Serial.println("button1_state = HIGH");
  }
  if ( digitalRead(BUTTON2_PIN) == HIGH ) { 
    Serial.println("button2_state = HIGH");
  }
  if ( digitalRead(BUTTON3_PIN) == HIGH ) { 
    Serial.println("button3_state = HIGH");
  }

	// publish
	encoderPub();

  #ifdef ENABLE_GPS
    gpsPub();
  #endif

  // check connection to master (rosserial)
  if (!nh.connected()) {
    ros_connected = false;
    led_time = LED_TIMER_NOT_CONNECTED;
  } else {
    ros_connected = true;
    led_time = LED_TIMER_CONNECTED;
  }

  lcdUpdate();

  blinkLedBuiltin();

  nh.spinOnce();
}